app/views/trips/edit.html.erb

  <h3>Poll Options</h3>
  <% @trip.polls.each do |poll| %>
---
SELECT "polls".* FROM "polls" WHERE "polls"."trip_id" = $1  [["trip_id", 1]]