app/views/trips/show.html.erb

SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."trip_id" = $1 AND "rsvps"."response" = 'yes'  [["trip_id", 2]]
---
        <div class='going'>
          <% @trip.rsvps.where(:response => 'yes').each do |attending| %>

SELECT COUNT(*) FROM "posts" WHERE "posts"."trip_id" = $1  [["trip_id", 2]]
---
      <h4> Posts </h4>
      <% if @trip.posts.count > 0 %>

SELECT "assets".* FROM "assets" WHERE "assets"."trip_id" = $1  [["trip_id", 2]]
---
      <h4> Files &amp; Photos </h4>
      <% if @trip.assets.present? %>

SELECT "activities".* FROM "activities" WHERE "activities"."trip_id" = $1  [["trip_id", 1]]
SELECT COUNT(*) FROM "activities" WHERE "activities"."trip_id" = $1  [["trip_id", 2]]
---
      <h4> Activities </h4>
      <% if @trip.activities.count > 0 %>