app/views/memberships/_list.html.erb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 1]]
---
<% @group.memberships.each do |member| %>