app/views/users/show.html.erb

    <h4> links: </h4>
    <% @user.links.each do |web_link| %>
---
SELECT "web_links".* FROM "web_links" WHERE "web_links"."user_id" = $1  [["user_id", 1]]