app/controllers/activities_controller.rb

INSERT INTO "activities" ("activity_type", "address", "cc_required", "contact", "created_at", "date", "deadline", "end_time", "link", "min_age", "name", "notes", "price", "start_time", "tickets_available", "trip_id", "updated_at", "user_id", "venue") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
---
  def create
    @activity = @trip.activities.build(activity_params)
    @activity.user_id = current_user.id
    if @activity.save

UPDATE "activities" SET "address" = $1, "contact" = $2, "price" = $3, "start_time" = $4, "end_time" = $5, "notes" = $6, "updated_at" = $7 WHERE "activities"."id" = 1
---
  def update
    if current_user.id == @activity.user_id
      if @activity.update(activity_params)

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_trip
      @trip = Trip.find(params[:trip_id])

SELECT "activities".* FROM "activities" WHERE "activities"."trip_id" = $1 AND "activities"."id" = $2 LIMIT 1  [["trip_id", 1], ["id", "1"]]
---
    def set_activity
      @activity = @trip.activities.find(params[:id])