app/controllers/groups_controller.rb

  def index
    @groups = Group.order('name ASC')
---
SELECT "groups".* FROM "groups" ORDER BY name ASC

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO "groups" ("avatar", "created_at", "description", "facebook_url", "group_type", "groupme_id", "location", "meetup_url", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    #set_group
    @membership = @group.memberships.build
    @memberships = Membership.where(group_id: @group.id)
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1  [["group_id", 1]]

  def update
    #set_group
    if @group.update(group_params)
---
UPDATE "groups" SET "name" = $1, "description" = $2, "group_type" = $3, "location" = $4, "avatar" = $5, "facebook_url" = $6, "meetup_url" = $7, "groupme_id" = $8, "updated_at" = $9 WHERE "groups"."id" = 1

  def deactivate
    @group.update(is_active: false)
---
UPDATE "groups" SET "is_active" = $1, "updated_at" = $2 WHERE "groups"."id" = 1  [["is_active", false], ["updated_at", Wed, 26 Feb 2014 11:23:27 UTC +00:00]]

  def reactivate
    @group.update(is_active: true)
---
UPDATE "groups" SET "is_active" = $1, "updated_at" = $2 WHERE "groups"."id" = 1  [["is_active", true], ["updated_at", Wed, 26 Feb 2014 11:23:03 UTC +00:00]]

  def destroy
    #set_group
    @group.destroy
---
DELETE FROM "groups" WHERE "groups"."id" = $1  [["id", 1]]