app/controllers/invitations_controller.rb

  def create
    if params[:invitation]
      params[:invitation][:email].split(',').each do |email|
        @invitation = Invitation.create(trip_id: @trip.id,
                                        email: email,
                                        user_id: current_user.id)
---
INSERT INTO "invitations" ("created_at", "email", "trip_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 26 Feb 2014 11:24:14 UTC +00:00], ["email", "user17@example.com"], ["trip_id", 1], ["updated_at", Wed, 26 Feb 2014 11:24:14 UTC +00:00], ["user_id", 1]]

    def set_trip
      @trip = Trip.find(params[:trip_id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]