app/controllers/memberships_controller.rb

  def create
    #set_group
    @membership = @group.memberships.build(membership_params)
    if is_group_admin?(current_user) or current_user.is_admin?
      if @membership.save
---
INSERT INTO "memberships" ("created_at", "email", "group_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 26 Feb 2014 11:22:57 UTC +00:00], ["email", "user25@example.com"], ["group_id", 1], ["updated_at", Wed, 26 Feb 2014 11:22:57 UTC +00:00]]

  def approve
    if is_group_admin?(current_user) or current_user.is_admin?
      @membership.update(is_active: true, last_updated_by: current_user.id)
---
UPDATE "memberships" SET "is_active" = $1, "last_updated_by" = $2, "updated_at" = $3 WHERE "memberships"."id" = 4  [["is_active", true], ["last_updated_by", 1], ["updated_at", Wed, 26 Feb 2014 11:22:57 UTC +00:00]]

  def pend
    if is_group_admin?(current_user) or current_user.is_admin?
      if current_user.email  == @membership.email
        flash[:alert] = "Error, you can't set yourself to pending."
        redirect_to group_path(@group)
      else
        @membership.update(is_active: false, last_updated_by: current_user.id)
---
UPDATE "memberships" SET "is_active" = $1, "updated_at" = $2 WHERE "memberships"."id" = 2  [["is_active", false], ["updated_at", Wed, 26 Feb 2014 11:26:12 UTC +00:00]]

  def demote
    if is_group_admin?(current_user) or current_user.is_admin?
      if current_user.email  == @membership.email
        flash[:alert] = "Error, you can't demote yourself."
        redirect_to group_path(@group)
      else
        @membership.update(is_admin: false, last_updated_by: current_user.id)
---
UPDATE "memberships" SET "is_admin" = $1, "last_updated_by" = $2, "updated_at" = $3 WHERE "memberships"."id" = 5  [["is_admin", false], ["last_updated_by", 1], ["updated_at", Wed, 26 Feb 2014 11:22:58 UTC +00:00]]

  def remove
    #set_membership
    if is_group_admin?(current_user) or current_user.is_admin?
      if current_user.email  == @membership.email
        flash[:alert] = "Error, you can't demote yourself."
        redirect_to group_path(@group)
      else
        @membership.destroy
---
DELETE FROM "memberships" WHERE "memberships"."id" = $1  [["id", 2]]

    def set_group
      @group = Group.find(params[:group_id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = $1 LIMIT 1  [["id", "1"]]

    def set_membership
      @membership = @group.memberships.find_by email: params[:email]
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."group_id" = $1 AND "memberships"."email" = 'user88@example.com' LIMIT 1  [["group_id", 1]]