app/controllers/pages_controller.rb

SELECT "trips".* FROM "trips" ORDER BY start_date ASC LIMIT 4
---
  def index
    @trips = Trip.order('start_date ASC').limit(4)