app/controllers/polls_controller.rb

  def create
    @poll = @trip.polls.build(poll_params)
    if @poll.save
---
INSERT INTO "polls" ("created_at", "end_date", "expires", "notes", "poll_type", "start_date", "title", "trip_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    # set_poll
    if @trip.user_id == current_user.id or current_user.is_admin?
      if @poll.update(poll_params)
---
UPDATE "polls" SET "start_date" = $1, "end_date" = $2, "notes" = $3, "expires" = $4, "updated_at" = $5 WHERE "polls"."id" = 1  [["start_date", Tue, 26 Jun 0014], ["end_date", Fri, 26 Oct 0014], ["notes", "A new note"], ["expires", nil], ["updated_at", Wed, 26 Feb 2014 11:25:47 UTC +00:00]]

  def destroy
    # set_poll
    if @trip.user_id == current_user.id or current_user.is_admin?
      @poll.destroy
---
DELETE FROM "polls" WHERE "polls"."id" = $1  [["id", 1]]

    def set_trip
      @trip = Trip.find(params[:trip_id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]

    def set_poll
      @poll = @trip.polls.find(params[:id])
---
SELECT "polls".* FROM "polls" WHERE "polls"."trip_id" = $1 AND "polls"."id" = $2 LIMIT 1  [["trip_id", 1], ["id", "2"]]