app/controllers/posts_controller.rb

  def create
    @post = @trip.posts.build(:user_id => current_user.id,
                              :message => params[:post][:message])
    if @post.save
---
INSERT INTO "posts" ("created_at", "message", "trip_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 26 Feb 2014 11:26:25 UTC +00:00], ["message", "This is just a test"], ["trip_id", 1], ["updated_at", Wed, 26 Feb 2014 11:26:25 UTC +00:00], ["user_id", 2]]

    def set_trip
      @trip = Trip.find(params[:trip_id])
---
SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]