app/controllers/transportations_controller.rb

INSERT INTO "transportations" ("arrival_city", "arrival_date", "arrival_time", "created_at", "departure_city", "departure_date", "departure_time", "notes", "price", "seat_number", "service_number", "transportation_type", "trip_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
  def create
    @transportation = @trip.transportations.build(transportation_params)
    @transportation.user_id = current_user.id
    if @transportation.save

UPDATE "transportations" SET "service_number" = $1, "seat_number" = $2, "price" = $3, "notes" = $4, "departure_time" = $5, "arrival_time" = $6, "updated_at" = $7 WHERE "transportations"."id" = 1
---
  def update
    if current_user.id == @transportation.user_id
      if @transportation.update(transportation_params)

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT 1  [["id", "1"]]
---
    def set_trip
      @trip = Trip.find(params[:trip_id])

SELECT "transportations".* FROM "transportations" WHERE "transportations"."trip_id" = $1 AND "transportations"."id" = $2 LIMIT 1  [["trip_id", 1], ["id", "1"]]
---
    def set_transportation
      @transportation = @trip.transportations.find(params[:id])