app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips" ORDER BY start_date ASC
---
  def index
    @trips = Trip.order('start_date ASC')

INSERT INTO "trips" ("created_at", "end_date", "hash_tag", "hide_guestlist", "is_private", "location", "start_date", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @trip = Trip.new(trip_params)
    @trip.user = current_user
    if @trip.save

SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."trip_id" = $1 AND "rsvps"."user_id" = 1 ORDER BY "rsvps"."id" ASC LIMIT 1  [["trip_id", 2]]
---
  def show
    #set_trip
    @invitations = @trip.invitations
    if current_user
      @rsvp = @trip.rsvps.where(:user_id => current_user.id).first

UPDATE "trips" SET "title" = $1, "hash_tag" = $2, "start_date" = $3, "end_date" = $4, "updated_at" = $5 WHERE "trips"."id" = 1  [["title", "Revised Trip Title"], ["hash_tag", ""], ["start_date", Fri, 08 Mar 2013], ["end_date", Sun, 10 Mar 2013], ["updated_at", Wed, 26 Feb 2014 11:22:21 UTC +00:00]]
---
  def update
    #set_trip
    if @trip.update(trip_params)

UPDATE "trips" SET "is_active" = $1, "updated_at" = $2 WHERE "trips"."id" = 1  [["is_active", false], ["updated_at", Wed, 26 Feb 2014 11:24:50 UTC +00:00]]
---
  def cancel
    if current_user == @trip.user
      @trip.update(is_active: false)

UPDATE "trips" SET "is_active" = $1, "updated_at" = $2 WHERE "trips"."id" = 1  [["is_active", true], ["updated_at", Wed, 26 Feb 2014 11:22:40 UTC +00:00]]
---
  def reactivate
    if current_user == @trip.user
      @trip.update(is_active: true)

SELECT "polls".* FROM "polls" WHERE "polls"."trip_id" = $1 AND "polls"."poll_type" = 'location'  [["trip_id", 1]]
---
  def preview_invitation
    @dates_options = @trip.polls.where(poll_type: 'date')

DELETE FROM "trips" WHERE "trips"."id" = $1  [["id", 1]]
---
  def destroy
    #set_trip
    @trip.destroy

INSERT INTO "rsvps" ("created_at", "response", "trip_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Wed, 26 Feb 2014 11:23:07 UTC +00:00], ["response", ""], ["trip_id", 1], ["updated_at", Wed, 26 Feb 2014 11:23:07 UTC +00:00], ["user_id", 2]]
SELECT "rsvps".* FROM "rsvps" WHERE "rsvps"."trip_id" = $1 AND "rsvps"."user_id" = 2 AND "rsvps"."response" = '' ORDER BY "rsvps"."id" ASC LIMIT 1  [["trip_id", 1]]
UPDATE "rsvps" SET "response" = $1, "updated_at" = $2 WHERE "rsvps"."id" = 1  [["response", "no"], ["updated_at", Wed, 26 Feb 2014 11:23:07 UTC +00:00]]
---
  def rsvp
    @rsvp = @trip.rsvps.where(:user_id => current_user.id, :response => "").first_or_create
    responses = ['yes','maybe', 'no']
    if ['yes','maybe', 'no'].include? params[:response]
      if @rsvp.update(:response => params[:response])

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 ORDER BY "trips"."id" ASC LIMIT 1  [["id", 2]]
---
    def set_trip
      @trip = Trip.find(params[:id])