app/controllers/users_controller.rb

SELECT "trips".* FROM "trips" WHERE "trips"."user_id" = 1
---
  def show
    #set_user
    @trips = Trip.where(user_id: @user.id)

UPDATE "users" SET "first_name" = $1, "last_name" = $2, "gender" = $3, "status" = $4, "avatar" = $5, "zip_code" = $6, "mobile_number" = $7, "skype_id" = $8, "dietary_pref" = $9, "roommate_pref" = $10, "updated_at" = $11 WHERE "users"."id" = 1
---
  def update
    #set_user
    if @user.update(user_params)