app/controllers/web_links_controller.rb

  def create
    #set_user
    # Some hacky bullshit. validation should move to front. needed to pass spec
    if params[:web_link][:url] != ""
      @web_link = @user.web_links.build(web_link_params)
      if @web_link.save
---
INSERT INTO "web_links" ("created_at", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 26 Feb 2014 11:22:35 UTC +00:00], ["updated_at", Wed, 26 Feb 2014 11:22:35 UTC +00:00], ["url", "http://www.somenetwork.com/someuser"], ["user_id", 1]]

  def destroy
    @web_link = WebLink.find(params[:id])
    if @user.id == @web_link.user_id
      @web_link.destroy
---
SELECT "web_links".* FROM "web_links" WHERE "web_links"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "web_links" WHERE "web_links"."id" = $1  [["id", 1]]

    def set_user
      @user = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1